#მომხმარებელს შეაყვანინე რიცხვი n. for ციკლით დაბეჭდე 1-დან n-მდე ყველა რიცხვი და თითოეულის კვადრატი.
#მაგალითად: 3 → 1, 4, 9

#შექმენი პროგრამა, რომელიც 1-დან 100-მდე გაივლის და დაბეჭდავს მხოლოდ იმ რიცხვებს, რომლებიც 3-ზეც და 5-ზეც იყოფა.

#მომხმარებელს შეაყვანინე 5 რიცხვი. for ციკლით იპოვე და დაბეჭდე მათი ჯამი და საშუალო არითმეტიკული.

#🔁 while ციკლი

#მომხმარებელს შეაყვანინე რიცხვი. while-ის გამოყენებით დაითვალე, რამდენი ციფრისგან შედგება ეს რიცხვი.

#შექმენი პაროლის პროგრამა. მომხმარებელს ჰქონდეს 3 მცდელობა სწორი პაროლის შესაყვანად.
#თუ სწორად შეიყვანა → "სწორია"
#თუ 3-ჯერ შეცდა → "დაგებლოკა"

#მომხმარებელს შეაყვანინე რიცხვები მანამ, სანამ არ შეიყვანს 0-ს. ბოლოს დაბეჭდე შეყვანილი რიცხვების ჯამი. 0 ჯამში არ უნდა ჩაითვალოს.

#📋 სიები — List

#შექმენი რიცხვების სია. for ციკლით იპოვე და დაბეჭდე რამდენი ლუწი და რამდენი კენტი რიცხვია სიაში.

#შექმენი რიცხვების სია და შექმენი მეორე, ცარიელი სია. პირველი სიიდან მხოლოდ 10-ზე მეტი რიცხვები დაამატე მეორე სიაში append()-ით.

#შექმენი 5 რიცხვის სია. იპოვე ყველაზე დიდი და ყველაზე პატარა რიცხვი, მაგრამ არ გამოიყენო max() და min() — გამოიყენე for და if.

number = int(input("enter a number: "))
for i in range(1,number):
    print(i**2)

for i in range (1 ,100):
    if i % 3 == 0 and i % 5 ==0:
        print (i)


sum = 0
for i in range(5):
    num = int(input("enter a number:"))
    sum + num 
    print(num)

num1 = int(input("შეიყვანე რიცხვი"))

count = 0

while num > 0:

    num = num // 10

    count += 1

print("ციფრების რაოდენობა",count)

password = ""
attempts = 0

while attempts <3:
    password = input("პაროლი")

    if password == "1234":
        print("სწორია")
        break

    attempts += 1

    if attempts == 3:
        print("დაბლოკე")