#1) კომენტარებით ახსენით რას აკეთებს ნაშთიანი გაყოფის ოპერატორი ( % ).

#1 გაყოფის დროს ნაშთი გამოყავს მაგ. 10 % 3= 1 რადგან ნაშთი ერთი გვრჩება


#2) კომენტარებით ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში Python-ში.

#2 რიცხი რო ხარისხში Python-ში ციფრს უნდა მივუტერთ ორი ფიფქი და შემდეგ რიცხვი მერამდენე ხარისხშც გვინდა რო ავიყვანოთ

#3) შექმენი ცვლადი, სადაც შეინახავ 6-ის მეორე ხარისხს. შემდეგ დაბეჭდე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი.

#3 პასუხი 36
box = 6
print (box**2)


#4)კომენტარებში დაწერე რას გამოიტანს:
#  1)17%5 = 2
   #2)25 % 4 = 1
   #3)30 % 7 = 2

#5 კომენტარებით ახსენით რა არის მონაცემთა ტიპები (Data Types).
# მონაცემტა ტიპები არის კოდები რომელიც კომპიუტერს ეუბნება რა უნდა გააკეთოს

#6) ჩამოწერე Python-ის ძირითადი მონაცემთა ტიპები.
# syr. , int. , bool. , float
#7) თითოეულ მონაცემთა ტიპს კომენტარებით მიუწერე განმარტება.
# 1) syr ინფორმაცია რომელიც არის მოთავსებული ბრჭყალებში
   #2)int. არის დადებიტი ან უარყოფითი რიცხვები
   #3)bool. ის შეიძლება იყოს true & false
   #4)flooat არის რიცხვი რომელიც არის ჭლადშ ან ათწილადში ჩაწერილი
   

#8) შექმენი ცვლადი, სადაც შეინახავ შენს სახელს, მეორე ცვლადში შენს ასაკს, ხოლო მესამე ცვლადში იმას, გყავს თუ არა შინაური ცხოველი. შემდეგ დაბეჭდე ყველა ცვლადი.
name = "deme" 
age = 14
house_pet = True

print(name , age , house_pet)


#9)  შექმენი ცვლადი, სადაც შეინახავ შენი მეგობრის სახელს, მეორე ცვლადში მის ასაკს, ხოლო მესამე ცვლადში მის სიმაღლეს. შემდეგ დაბეჭდე ყველა ცვლადი.
friend_name = "giorgi"
friend_age = 16
friend_hight = 184
print(friend_name , friend_age , friend_hight )
#10) შექმენი ორი რიცხვითი ცვლადი. იპოვე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი. თითოეული შედეგი დაბეჭდე.

num = 10
num1 = 3
print (num + num1)
print (num - num1)
print (num * num1)
print (num / num1)
print (num % num1)
#11) შექმენი ცვლადი number, სადაც შეინახავ ნებისმიერ რიცხვს. აიყვანე ის მესამე ხარისხში და დაბეჭდე შედეგი.

number = 2 
print (number**3)

#12) შექმენი Boolean ტიპის ორი ცვლადი: ერთში შეინახე True, მეორეში False. შემდეგ ორივე დაბეჭდე.

dog = True
cat = False

#13)კომენტარებით ახსენით რა განსხვავებაა int-სა და float-ს შორის.
#int არის მთელი რიცხვები და float არის ათწილადი ან წილადი


#14)შექმენი ცვლადი `price`, სადაც შეინახავ პროდუქტის ფასს, და ცვლადი `quantity`, სადაც შეინახავ რაოდენობას. გამოთვალე საერთო ღირებულება და დაბეჭდე.
price = 2
quantity = 10
print(price * quantity)

#15) კომენტარებით ახსენით რისთვის გამოიყენება print() ფუნქცია Python-ში
#print ფუნქციას გამოვინებთ რო ინფორმაცია რაც არის მოთავსებულ რო ამოვბეჭდოთ
