#1)კომენტარებით ჩამოწერე ყველა მათემატიკური ოპერატორი (+, -, *, /, %, **) და თითოეულზე დაწერე თითო მაგალითი.
print(5 + 10)
print(100 - 99)
print(30 * 50)
print(12 / 4)
print(100%30)
print(10**2)
#2)შექმენი ორი ცვლადი num1 და num2, გაუტოლე მნიშვნელობები 30 და 15. დაბეჭდე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი.
number1 = 30
number2 = 15
print( number1 + number2 )


#3) შექმენი სამი ცვლადი: a = 10, b = 20, c = 30. დაბეჭდე სამივე რიცხვის ჯამი

a = 10
b = 20
c =30
print (a+b+c)

#4)შექმენი სამი ცვლადი: num1 = 8, num2 = 4, num3 = 2. შეასრულე ოპერაცია (num1 + num2) * num3 და დაბეჭდე შედეგი.

num1 = 8
num2 = 4
num3 = 2
print ((num1 + num2) * (num3))

#5) შექმენი ორი ცვლადი x და y. გაუტოლე მნიშვნელობები 50 და 25. ჯერ იპოვე მათი სხვაობა, შემდეგ მიღებული შედეგი გაამრავლე 2-ზე.

x = 50 
y = 25
print((x-y) * (2))
    


#6)შექმენი ცვლადი age და შეინახე მნიშვნელობა 18. შემდეგ შექმენი კიდევ ერთი ცვლადი nextAge, რომელიც იქნება age + 1. დაბეჭდე ორივე.

age = 18
nextage = age + 1
print(age)
print (nextage)

#7)შექმენი ცვლადი price = 200 და discount = 35. გამოთვალე ფასდაკლების შემდეგ დარჩენილი თანხა და დაბეჭდე.

price = 200 
discount = 35

print (price - discount)


#8) შექმენი ცვლადი number = 9. იპოვე მისი კვადრატი (square) და დაბეჭდე შედეგი.



number = 9

print (number**2)


#9)შექმენი ოთხი ცვლადი: a = 5, b = 10, c = 15, d = 20. დაბეჭდე ყველა რიცხვის ჯამი.


a = 5
b = 10
c = 15
d = 20

print (a+b+c+d)


#10)შექმენი ორი ცვლადი width = 12 და height = 8. გამოთვალე მართკუთხედის ფართობი და დაბეჭდე.

width = 12
height = 8

print (width * height)