#შექმენით ცვლადი, სადაც შეინახავთ 6-ს,

#შემდეგ print მეშვეობით გამოიტანეთ ის ტერმინალში

#Bonus:
#შექმენით მეორე ცვლადიც სადაც შეინახავთ ტექსტს და ისიც გამოიტანეთ print მეშვეობით

a = 6
b = 2
print (a , b)

#level 02:
#1) რას უდრის 1 byte?
#2) რას უდრის 1 GB?
#3) ახსენი რა არის  და რისთვის გამოიყენება CPU.
#4) ახსნეი რა არის Low level და High level.
#5) ჩამოწერე კომენტარებით ყველა მათემატიკური მოქმედება.
#6) შექმენი ცვლადი სახელად num1 და გაუტოლე მნიშვნელობა 5, შემდეგ შექმენი ცვლადი სახელად num2 და შეინახე მნიშვნელობა 10, შემდეგ დაბეჭდე ამ ორი ცვლადის ჯამი
#7) შექმენი ორი ცვლადი და შენიახერ ერთში 20, მეორეში 5. დაპრინტე ამ ორ ცვლადის გაყოფა
#8) სექმენი სამი ცვლადი a, b, c.  გაუტოლე ეს ცვლადები 5, 10, 2 და მათზე მოახდინე სამივე რიცხვის ერთმანეთზე გამრავლება

#1) byte = 8 bit
#2) 1 GB = 1024 MB
#3) cpu  არის კომპიუტერის ტვინი რომელიც რთულ დავალებებიას შესასრულებლად
#4) low levrl რთლი ენა high level მარტივი ენა
#5) +,-,*,/.%,**
#6)
num1 = 5
num2 = 10
print (num1 + num2)
#7)
box1 =20
box2 =5
print(box1 / box2)
#8) 
a = 5
b =10 
c =2
print (a * b * c)